tutorials/solidFoam/taylorImpact/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    symmetricY
    {
        type            symmetry;
        physicalType    symmetry;
        nFaces          12;
        startFace       1188;
    }
    symmetricZ
    {
        type            symmetry;
        physicalType    symmetry;
        nFaces          160;
        startFace       1200;
    }
    symmetricX
    {
        type            symmetry;
        physicalType    symmetry;
        nFaces          160;
        startFace       1360;
    }
    free
    {
        type            patch;
        physicalType    patch;
        nFaces          172;
        startFace       1520;
    }
)

// ************************************************************************* //
