tutorials/solidFoam/taylorImpact/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basic;

thermoType
{
    transport constIso;
    thermo eConst;
    equationOfState rhoConst;
}

specie
{
    molWeight 100;
}
equationOfState
{
    rho0    8930;
}
thermodynamics
{
    Cv      500;
    Hf      0;
}
transport
{
    kappa   0.1;
}



// ************************************************************************* //
