tutorials/solidFoam/taylorImpact/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 -227 0);

boundaryField
{
    symmetricY
    {
        type            symmetry;
    }

    symmetricZ
    {
        type            symmetry;
    }

    symmetricX
    {
        type            symmetry;
    }

    free
    {
        type            calculated;
        value           uniform (0 -227 0);
    }
}


// ************************************************************************* //
