tutorials/solidFoam/taylorImpact/0/D
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      D;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    symmetricY
    {
        type            solidSymmetry;
        patchType       symmetry;
        value           uniform (0 0 0);
    }

    symmetricZ
    {
        type            solidSymmetry;
        patchType       symmetry;
        value           uniform (0 0 0);
    }

    symmetricX
    {
        type            solidSymmetry;
        patchType       symmetry;
        value           uniform (0 0 0);
    }

    free
    {
        type            solidTractionFree;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
